app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test post!"], ["user_id", 5], ["created_at", "2016-04-25 15:43:49.428186"], ["updated_at", "2016-04-25 15:43:49.428186"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)